driver-tests/bpelse/assign/CopyByValue/CopyByValueJbi/test/results/OutboundVariablesTest/Actual_20130221160615_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Message xmlns="http://xml.netbeans.org/schema/bpelse/assign/VarialbleConsistencyTestAfterReplyAndInvoke/XmlSchema" xmlns:msgns="http://j2ee.netbeans.org/bpelse/assign/VarialbleConsistencyTestAfterReplyAndInvoke/wsdl/wsdl">
      <Id>corrValue</Id>
      <Data>Test Passed. Values as expected.</Data>
    </Message>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>