driver-tests/bpelse/assign/CopyByValue/CopyByValueJbi/test/OutboundVariablesTest/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:Message xmlns:msgns="http://j2ee.netbeans.org/bpelse/assign/VarialbleConsistencyTestAfterReplyAndInvoke/wsdl/wsdl" xmlns:ns1="http://xml.netbeans.org/schema/bpelse/assign/VarialbleConsistencyTestAfterReplyAndInvoke/XmlSchema">
      <ns1:Id xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://xml.netbeans.org/schema/bpelse/assign/VarialbleConsistencyTestAfterReplyAndInvoke/XmlSchema" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">corrValue</ns1:Id>
      <ns1:Data>Test Passed. Values as expected.</ns1:Data>
    </ns1:Message>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
